```sql
<div style="text-align: center; font-size: 24px;">Мова опису даних (DDL) (views, materialized views, tables)</div>
```

**Data Definition Language (DDL)** --- це мова, яка використовується для
створення, модифікації та видалення структур бази даних. Вона дозволяє
нам створювати та змінювати таблиці, визначати стовпці, а також
створювати індекси та обмеження. **DDL** також включає команди для
управління іншими об\'єктами, такими як схеми, представлення
```sql
<div style="text-align: center; font-size: 24px;">(views) **та матеріалізовані представлення **(materialized views).</div>
```

-   **Таблиці (tables)** --- це основні об\'єкти бази даних, у яких
    зберігаються фактичні дані. Вони складаються з рядків і стовпців,
    які організовують інформацію у структурованому форматі. Таблиці є
    основою для зберігання, керування й обробки даних у базі даних.

-   **Представлення (views)** --- це віртуальні таблиці, які базуються
    на реальних даних з однієї або декількох таблиць. Вони дозволяють
    нам створювати «види» даних, які відображають лише потрібну
    інформацію та приховують складні запити або конфіденційні дані.
    Представлення спрощують роботу з даними, забезпечуючи зручний доступ
    до необхідної інформації.

-   **Матеріалізовані представлення (materialized views)** --- це
    спеціальний тип представлень, які зберігають фактичні дані у вигляді
    фізичної таблиці. Вони корисні, коли нам потрібно створити кеш або
    попередньо обчислені дані для оптимізації продуктивності запитів.
    **Матеріалізовані представлення можуть значно прискорити виконання
    запитів і покращити продуктивність бази даних.**

*📎 Вивчення **мови опису даних (DDL)** надає нам можливість створювати,
змінювати структуру бази даних і керувати нею. Ми можемо створювати
таблиці для зберігання даних, встановлювати типи даних та обмеження для
стовпців, а також створювати представлення та матеріалізовані
представлення для зручного доступу до інформації.*

Розуміння **мови опису даних (DDL)** допомагає ефективно працювати з
базами даних, створювати правильні структури даних, оптимізувати
продуктивність запитів і забезпечувати зручний доступ до необхідної
інформації.

```sql
<div style="text-align: center; font-size: 24px;">Команди DDL</div>
```

DDL --- це набір команд SQL, які використовуються для створення, зміни
та видалення структур бази даних, але не даних. Ці команди переважно не
застосовуються звичайним користувачем бази. Вони є частиною роботи
архітекторів і бізнес-аналітиків.

Список команд DDL:

-   **Команда CREATE** використовується для створення бази даних або її
    об'єктів (таблиці, індексу, функції, представлень, процедури
    зберігання та тригерів). Наприклад, CREATE TABLE використовується
    для створення таблиці, CREATE VIEW --- для створення представлення.

-   **Команда DROP** використовується для видалення об'єктів із бази
    даних. Наприклад, DROP TABLE видаляє таблицю, DROP VIEW видаляє
    представлення.

-   Команда ALTER використовується для зміни структури бази даних.
    Наприклад, ALTER TABLE використовується для додавання, зміни або
    видалення стовпців у таблиці.

-   **Команда TRUNCATE** використовується для видалення всіх записів із
    таблиці, зокрема для видалення усіх виділених для записів місць. Це
    швидший спосіб видалення даних, аніж використання команди DELETE.

-   **Команда RENAME** використовується для перейменування об'єкта, що
    існує в базі даних. Наприклад, RENAME TABLE дозволяє перейменувати
    таблицю.

Давай розглянемо детальніше команду **CREATE**, оскільки вона часто
зустрічається в різних документаціях, тому ти постійно будеш бачити цей
синтаксис. Із рештою команд ти зможеш ознайомитися самостійно.

```sql
<div style="text-align: center; font-size: 24px;">Команда CREATE</div>
```

Щоб створити нову таблицю, тобі потрібно використати **CREATE TABLE** із
таким синтаксисом:

```sql
```sql
CREATE TABLE table_name (
    column_name_1 data_type default value column_constraint,
    column_name_2 data_type default value column_constraint,
    ...
    table_constraint
);
```

```
Мінімально необхідна інформація для створення нової таблиці --- це ім\'я
таблиці та ім\'я стовпця.

Ім\'я таблиці повинно бути унікальним у базі даних. Якщо ти створюєш
таблицю з ім\'ям, яке вже існує, система баз даних видасть помилку.

У **CREATE TABLE** ти вказуєш список стовпців, розділених комами. Кожен
стовпець визначається ім\'ям, типом даних, значенням за замовчуванням і
за потреби одним або декількома обмеженнями.

-   **Тип даних** стовпця визначає, які типи даних можуть бути збережені
    в цьому стовпці. Це можуть бути числа, рядки, дати тощо (ми
    обговорювали це раніше).

-   **Обмеження стовпця** визначає тип значення, яке можна зберігати у
    стовпці. Наприклад, **NOT** **NULL** гарантує, що стовпець не
    містить значення **NULL**.

-   **Стовпець може мати кілька обмежень**. Наприклад, username може
    мати обидва обмеження: **NOT NULL** і **UNIQUE**.

Припустимо, що ти хочеш додати до нашої схеми таблицю із тренінговими
програмами для співробітників.

Наступна команда створює таблицю з курсами:

```sql
```sql
CREATE TABLE courses (
    course_id SERIAL PRIMARY KEY,
    course_name VARCHAR(50) NOT NULL
);
```

```
Тип даних **course_id** позначається ключовим словом **SERIAL**.

Значення стовпця **course_id** дорівнює **PRIMARY KEY**. Це означає, що
коли ти вставляєш новий рядок у courses без надання значення для
**course_id**, система бази даних згенерує ціле значення для стовпця.

-   **Course_name** --- назви курсів. Його типом даних є рядок символів
    **(VARCHAR)** з максимальною довжиною 50 символів.

-   **NOT NULL** гарантує, що у стовпці не зберігаються
    значення** NULL** (адже курси без назв нас не цікавлять).

**Створення спеціальних об\'єктів в SQL (представлення та
матеріалізовані представлення)**

```sql
<div style="text-align: center; font-size: 24px;">Views у SQL</div>
```

📌 Представлення **(View)** --- це логічна й віртуальна копія таблиці,
яка створюється шляхом виконання оператора **SELECT**. **View**
--- логічна структура даних, яка не містить власних фізичних значень, а
формується на основі даних, що вже зберігаються в інших
таблицях. **View** не зберігаються окремо на диску. Таким чином, кожного
разу, коли тобі необхідні певні дані, потрібно виконувати запит до
відповідного представлення. Але сам вираз запиту зберігається на диску.

**View** не мають вартості зберігання/оновлення. Перегляди розроблено з
особливою архітектурою, яка означає, що для визначення структури
представлення існує стандарт **SQL**. Представлення використовуються,
коли доступ до даних необхідний рідко, але дані часто оновлюються.

Навіщо нам потрібні **Views?** Ось декілька важливих причин:

-   **Спрощення запитів **

Представлення дозволяють нам створювати «види» даних, які відображають
лише потрібну інформацію з однієї або декількох таблиць. Ми можемо
об\'єднувати, фільтрувати та перетворювати дані у представленнях, щоб
отримати потрібні результати. Це спрощує запити до даних і робить їх
більш читабельними та зрозумілими.

-   **Приховані складності **

Якщо в нас є складні запити, які часто використовуються в нашому
застосунку, ми можемо створити представлення для цих запитів. Це
дозволяє нам приховати складність запиту за простим ім\'ям
представлення. Ми можемо звертатися до представлення замість написання
довгого і складного запиту кожного разу.

-   **Безпека й обмеження**

Представлення можуть бути використані для обмеження доступу до даних. Ми
можемо створювати представлення, які показують лише певні стовпці або
рядки даних, приховуючи конфіденційну інформацію. Також ми можемо
надавати різні права доступу до представлень для різних користувачів або
ролей, гарантуючи безпеку даних.

-   **Модульність і повторне використання**

Представлення можуть бути застосовані для створення модульних блоків
даних, які можуть бути повторно використані в різних частинах системи.
Ми можемо створювати представлення для різних звітів, аналізів або інших
завдань і використовувати їх у різних запитах або застосунках.

-   **Оптимізація продуктивності**

Представлення можуть бути використані для створення попередньо
обчислених результатів запитів. Ми можемо створити представлення, яке
містить складний запит з обчисленнями або агрегатними функціями, і
зберегти його результати. Це дозволяє прискорити виконання запитів,
оскільки вони можуть звертатися до попередньо обчислених даних замість
виконання складних операцій кожного разу.

📌 Представлення **(Views) **покращують читабельність запитів, сприяють
безпеці даних, дозволяють повторно використовувати код і покращують
продуктивність системи.

```sql
<div style="text-align: center; font-size: 24px;">Materialized views</div>
```

📌 **Materialized views** (матеріалізовані представлення) в SQL є
спеціальним типом представлень **(views)**, які фізично зберігають дані
у вигляді таблиці. Матеріалізовані представлення містять реальні дані,
на відміну від звичайних представлень, що є віртуальними і формуються
динамічно під час виконання запиту. Їх можна оновлювати періодично або
за запитом.

Продуктивність **materialized views** краща, ніж у звичайних. Це тому,
що дані зберігаються на диску.

Іноді **Materialized views** також називають **«індексованими
представленнями»**, оскільки таблиця, створена після запиту,
індексується, що дозволяє отримати доступ до неї швидше й ефективніше.
Materialized views використовуються, коли необхідно часто звертатися до
даних, а дані в таблиці оновлюються нечасто.

Для чого нам потрібні матеріалізовані представлення? Ось кілька важливих
причин:

-   **Покращення продуктивності запитів**

Матеріалізовані представлення дозволяють зберігати результати складних
запитів або агрегатних функцій у вигляді фізичної таблиці. Це
дозволяє прискорити виконання запитів, оскільки вони можуть отримувати
доступ до попередньо обчислених даних, замість того, щоб виконувати
складні операції кожного разу. Матеріалізовані представлення особливо
корисні в ситуаціях, коли запити вимагають значного обсягу обчислень або
працюють з великими обсягами даних.

-   **Зменшення навантаження на базу даних**

Якщо в нас є складні запити, які виконуються часто й вимагають значних
ресурсів, матеріалізовані представлення дозволяють зменшити навантаження
на базу даних. Ми можемо попередньо обчислити та зберегти результати цих
запитів у матеріалізованих представленнях, що зменшує кількість виконань
складних операцій і скорочує час для відгуку системи.

-   **Підтримка звітності й аналітики**

Матеріалізовані представлення можуть бути використані для попередньої
підготовки даних для звітів та аналітичних задач. Ми можемо створити
матеріалізоване представлення, яке містить складні обчислення, агрегатні
функції або зведені дані, і періодично оновлювати його. Це дозволяє нам
швидко отримувати результати для звітів та аналізу без необхідності
виконувати тривалі запити кожного разу.

-   **Підтримка реплікації даних**

Матеріалізовані представлення можуть бути використані для створення
локальних копій даних на віддалених серверах або в різних базах даних.
Це забезпечує швидкий доступ до даних на віддалених вузлах без
необхідності передавати дані через мережу. Матеріалізовані представлення
можуть бути оновлені за розкладом або за вимогою, щоб синхронізувати
дані з джерелом.

```sql
<div style="text-align: center; font-size: 24px;">Відмінність views від materialized views</div>
```

Основна різниця між звичайними представленнями
```sql
<div style="text-align: center; font-size: 24px;">(views) **і матеріалізованими представленнями **(materialized views)</div>
```
в SQL:

<div align="center">
  <img src="../../assets/images/lesson_3_stvorennia_tablets_struktur/media/image1.png" width="600" />
</div>

Як створювати **views** та **materialized views**

Давай спробуємо створити два типи **View** на практиці за допомогою
команди **CREATE**.

Запит для **View**:

```sql
```sql
CREATE VIEW employees_details AS
SELECT employee_id
    , first_name
    , last_name
    , department_id
FROM "HR".employees;
```

```
У цьому прикладі ми створюємо **VIEW** з назвою **«employee_details»**,
який відображає інформацію про співробітників, зокрема їхні
ідентифікатори, імена та робочий відділ.

Запит для **Materialized View**:

```sql
```sql
CREATE MATERIALIZED VIEW department_statistics AS
SELECT department_id
    , COUNT(employee_id) AS employee_count
FROM "HR".employees
GROUP BY department_id;
```

```
У цьому прикладі ми створюємо матеріалізований **VIEW** з назвою
**«department_statistics»**, який містить статистику за
відділами. **Materialized View** зберігає результати запиту до таблиці,
що дозволяє швидший доступ до даних, але може потребувати оновлення у
процесі зміни даних у базі даних.

Розташовані вони в окремому переліку у схемі даних. Дивимося на скрін:

<div align="center">
  <img src="../../assets/images/lesson_3_stvorennia_tablets_struktur/media/image2.png" width="600" />
</div>

Отож, зафіксуємо найголовніше:

-   **Мова опису даних** **(DDL)** і **команди** **DDL** дозволяють
    створювати, змінювати й видаляти об\'єкти бази даних, ефективно
    керувати структурою даних та забезпечувати цілісність бази даних.

-   **Таблиці** **(tables)** --- основні об\'єкти зберігання даних у
    базі даних. Вони визначають структуру даних, їх типи та зв\'язки між
    ними.

-   **Представлення (views)** --- це віртуальні таблиці, які дають
    можливість зручно об\'єднати дані з однієї або кількох таблиць і
    представити їх у вигляді логічної структури.

-   **Представлення (views)** поліпшують читабельність і безпеку
    запитів, дозволяють повторно використовувати код і покращують
    продуктивність, забезпечуючи спрощений доступ до даних.

-   **Матеріалізовані представлення (materialized views)** --- це
    спеціальний тип представлень, які фізично зберігають дані у вигляді
    таблиці.

-   **Матеріалізовані представлення (materialized views)** дозволяють
    покращити продуктивність запитів, знизити навантаження на базу
    даних, підтримувати звітність і аналітику, а також забезпечувати
    локальну реплікацію даних.

```sql
<div style="text-align: center; font-size: 24px;">Підзапити та віртуальні таблиці CTE</div>
```

Підзапити та віртуальні таблиці **CTE (Common Table Expressions)** ---
це функціональні можливості, що використовуються в мові запитів **SQL**
для побудови складних та ефективних запитів.

📌 **Підзапити в SQL** --- це запити, які вкладаються в основний запит і
виконуються перед ним. Результат виконання підзапиту потім
використовується в основному запиті.

Підзапит може бути використаний у різних частинах **SQL**-запиту, таких
як **SELECT, FROM, WHERE, JOIN** або **UNION**, і може повертати одне
або кілька значень.

📌 **CTE (Common Table Expression)** --- це назва тимчасової таблиці,
яка створюється в пам\'яті під час виконання
**SQL**-запиту. **CTE** використовується для організації складних
запитів шляхом розбиття їх на менші, зрозуміліші частини. Результати
**CTE** можуть бути використані в основному запиті, ніби це єдине
джерело даних.

Основними перевагами використання підзапитів і **CTE** є зручність,
можливість зробити запит більш читабельним та підтримуваним. Крім того,
вони дозволяють уникнути дублювання коду, полегшити оптимізацію запиту й
забезпечити більшу гнучкість під час конструювання складних запитів.

Використання підзапитів і **CTE** дозволяє реалізувати більш складні
логічні операції та запити в **SQL**, що робить їх потужними
інструментами для роботи з базами даних.

```sql
<div style="text-align: center; font-size: 24px;">Підзапити в SQL</div>
```

Розпочнемо із задачі.

Припустимо, нам потрібно знайти всіх співробітників, які знаходяться в
локації з ідентифікатором 1700. Це можна реалізувати так:

1.  Спочатку знайдемо всі відділи, розташовані в локації з **id** 1700:

```sql
SELECT \* 

```
FROM \"HR\".departments

WHERE location_id = 1700;

<div align="center">
  <img src="../../assets/images/lesson_3_stvorennia_tablets_struktur/media/image3.png" width="600" />
</div>

2.  Тепер знайдемо всіх співробітників, які належать до відділу з
    локацією 1700, використовуючи список ідентифікаторів відділу з
    попереднього запиту:

```sql
SELECT employee_id

```
> , first_name
>
> , last_name

FROM \"HR\".employees

WHERE department_id IN (1, 3, 9, 10, 12)

ORDER BY first_name, last_name;

<div align="center">
  <img src="../../assets/images/lesson_3_stvorennia_tablets_struktur/media/image4.png" width="600" />
</div>

```sql
<div style="text-align: center; font-size: 24px;">Однак, це рішення має дві проблеми:</div>
```

Почнемо з того, що ти переглядав/-ла таблицю **departments**, щоб
перевірити, який відділ належить до локації 1700. Але початкове
запитання не стосувалося відділів, а було пов\'язане з місцем з кодом
1700.

Через невеликий обсяг даних ти можеш легко отримати список відділу й
підставити його в інший запит. Однак у реальній системі з великим
обсягом даних це може стати проблемою.

Набагато кращим розв\'язанням цієї проблеми є використання підзапиту.

Ось як це виглядає для нашої задачі:

```sql
SELECT employee_id

```
, first_name

, last_name

FROM \"HR\".employees

WHERE department_id IN

> (SELECT department_id

             FROM \"HR\".departments

             WHERE location_id = 1700)

ORDER BY first_name, last_name;

Ти можеш використовувати підзапит у багатьох місцях, наприклад:

-   з оператором **IN** або **NOT IN**

-   з оператором **SELECT**

-   з оператором **WHERE**

```sql
<div style="text-align: center; font-size: 24px;">Підзапит SQL з оператором IN або NOT IN</div>
```

У попередньому прикладі ти бачив/-ла, як підзапит використовувався з
оператором IN.

У наступному прикладі використовується підзапит з NOT IN для пошуку всіх
співробітників, які не знаходяться в локації 1700:

```sql
SELECT employee_id

```
, first_name

, last_name

FROM \"HR\".employees

WHERE department_id NOT IN

> (SELECT department_id
>
>                FROM \"HR\".departments

               WHERE location_id = 1700)

ORDER BY first_name, last_name;

```sql
<div style="text-align: center; font-size: 24px;">Підзапит SQL з операторами порівняння</div>
```

-   **Приклад 1 (оператор порiвняння =)**

У наступному прикладі показано співробітників, які мають найвищу
зарплату:

```sql
SELECT employee_id

```
> , first_name
>
> , last_name

FROM \"HR\".employees

> WHERE salary =
>
> (SELECT MAX(salary)

         FROM \"HR\".employees)

ORDER BY first_name

> , last_name;

У цьому прикладі **підзапит** повертає найвищу зарплату з усіх
працівників, а зовнішній запит знаходить працівників, чия зарплата
дорівнює цій найвищій сумі.

```sql
<div style="text-align: center; font-size: 24px;">Приклад 2 (оператор порiвняння \>)</div>
```

Наступний запит виводить усіх працівників, чия зарплата перевищує
середню зарплату:

```sql
SELECT employee_id

```
> , first_name
>
> , last_name

FROM \"HR\".employees

WHERE salary \>

> (SELECT AVG(salary)

         FROM \"HR\".employees)

ORDER BY first_name, last_name;

У цьому прикладі спочатку **підзапит** повертає середню зарплату всіх
працівників. Потім у зовнішньому запиті використовується оператор
«більше», щоб знайти всіх працівників, чия зарплата вища за середню.

```sql
<div style="text-align: center; font-size: 24px;">Підзапит SQL у виразі FROM</div>
```

Ти можеш використовувати **підзапит** у виразі **FROM** таким чином:

```sql
SELECT \*

```
FROM (subquery) AS table_name;

У цьому синтаксисі псевдонім таблиці є обов'язковим, оскільки всі
таблиці у виразі FROM повинні мати назву.

Наступний запит повертає середню зарплату кожного відділу:

```sql
SELECT AVG(salary) AS average_salary

```
FROM \"HR\".employees

GROUP BY department_id;

Ти можеш використовувати цей запит як **підзапит** у виразі **FROM** для
обчислення середньої зарплати відділів таким чином:

```sql
SELECT ROUND(AVG(average_salary), 0)

```
FROM ( SELECT AVG(salary) AS average_salary

    FROM \"HR\".employees

    GROUP BY department_id

) department_salary;

```sql
<div style="text-align: center; font-size: 24px;">Підзапит SQL у виразі SELECT</div>
```

**Підзапит** можна використовувати й у виразі **SELECT**. У наступному
прикладі знайдено значення зарплати всіх працівників, їхню середню
зарплату й різницю між зарплатою кожного працівника та середньою
зарплатою.

```sql
SELECT employee_id

```
> , first_name
>
> , last_name
>
> , salary
>
> , ( SELECT ROUND(AVG(salary), 0)
>
> FROM \"HR\".employees) average_salary

, salary - (SELECT ROUND(AVG(salary), 0)

      FROM \"HR\".employees) difference

FROM \"HR\".employees

ORDER BY first_name, last_name;

Як бачимо, **підзапити** --- справді потужний інструмент для вибірки
інформації. Але потрібно бути обережними, оскільки велика кількість
**підзапитів** або неправильне їх застосування можуть суттєво знизити
продуктивність (тобто швидкість виконання) запитів.

```sql
<div style="text-align: center; font-size: 24px;">CTE (Common Table Expression)</div>
```

**CTE (спільний вираз таблиці)** --- це тимчасовий іменований
підзапитний вираз у мові SQL, який може бути використаний всередині
запиту. Він дозволяє створювати й використовувати тимчасові таблиці, які
можуть бути опрацьовані, незалежно від основного запиту.

Ось синтаксис **CTE** в SQL:

> WITH *імʼя\_*CTE AS (
>
> *Запит*
>
> )
>
> *Основний_запит*

Де:

**WITH** --- ключове слово, яке починає підзапитний вираз **CTE**.

***ім\'я_CTE*** --- ім\'я, яке ти вибираєш для іменування **CTE**. Це
ім\'я буде використовуватися для звернення до CTE всередині основного
запиту.

***Запит*** --- запит, який виконується для створення тимчасової
таблиці.

***Основний_запит*** --- запит, у якому використовується **CTE**. Він
може посилатися на ім\'я\_**CTE** й обробляти результати **CTE**.

**CTE** надає зручний спосіб створення складних запитів, які можуть
містити рекурсивні або ітеративні операції над даними. Він також
дозволяє покращити читабельність і підтримуваність SQL-запитів.

Віртуальні таблиці **CTE** дозволяють створювати тимчасові набори даних,
які можна використовувати в межах одного запиту. Вони полегшують читання
та написання складних запитів, дозволяючи створювати тимчасові іменовані
таблиці всередині запиту. **CTE** зазвичай починаються з ключового
слова **WITH**, а потім визначаються як звичайна таблиця зі своїми
стовпцями та даними.

📎 *Ти можеш визначати декілька **СТЕ** в одному запиті **WITH**. Кожна
наступна **СТЕ** відділяється від попередньої комою. **СТЕ** виконуються
послідовно, то ж ти можеш використати попередню **СТЕ** для розрахунку
наступної в межах одного запиту, що розпочався з **WITH**.*

Загалом використання **підзапитів** і віртуальних таблиць **CTE** в
SQL дозволяє більш гнучко й ефективно працювати з даними, створювати
складні запити та спрощувати аналіз інформації.

Давай підсумуємо основні моменти:

-   **Підзапити** дозволяють включати один запит всередині іншого
    запиту. Вони використовуються для отримання більш точних і
    специфічних результатів, фільтрації даних або отримання пов\'язаних
    значень з інших таблиць. Підзапити можуть бути використані в різних
    частинах запиту, таких як **SELECT, FROM, WHERE**, і можуть бути
    вкладеними.

-   **Віртуальні таблиці CTE** дозволяють створювати тимчасові набори
    даних, які можна використовувати в межах одного запиту. Вони
    полегшують читання й написання складних запитів, дозволяючи
    створювати тимчасові іменовані таблиці всередині
    запиту. **CTE** зазвичай починаються з ключового слова **WITH**, а
    потім визначаються як звичайна таблиця зі своїми стовпцями й даними.

-   **Підзапити та віртуальні таблиці CTE** дозволяють більш гнучко й
    ефективно керувати даними та створювати складні запити. Вони
    полегшують читання й розуміння запитів, розбиваючи їх на логічні
    частини, та дозволяють використовувати результати одного запиту в
    іншому.

-   Також вони забезпечують модульність і повторне використання коду. Ти
    можеш визначити складний **підзапит** або **CTE** один раз і потім
    використовувати його у різних частинах запиту або навіть в різних
    запитах. Це покращує підтримку та спрощує зміни запитів у
    майбутньому.

-   **Підзапити** та **віртуальні таблиці** **CTE** можуть бути
    використані для виконання різних операцій, таких як фільтрація
    даних, агрегація, з\'єднання таблиць і багато іншого. Вони
    допомагають впоратися з складними запитами й ефективно обробляти
    великі обсяги даних.

```sql
<div style="text-align: center; font-size: 24px;">Команди UNION та UNION ALL</div>
```

Поговоримо про дві особливі команди в SQL --- **UNION** та **UNION
ALL**, які стануть твоїми найкращими помічниками під час роботи з
даними.

Ці команди є потужними інструментами для об\'єднання даних і створення
більш повної картини. Ми можемо отримати всю необхідну інформацію в
одному місці, що робить аналіз і роботу з даними простішими та
зручнішими.

Крім того, розуміння **UNION** та **UNION ALL** допоможе нам будувати
складні запити й отримувати потрібні результати.

Ці команди дозволять зібрати всі частинки головоломки разом і побачити
їх загальну картину.

```sql
<div style="text-align: center; font-size: 24px;">Команда UNION</div>
```

Уяви, що ти маєш кілька таблиць з інформацією і хочеш об\'єднати їх в
одну велику таблицю для зручнішого аналізу. Ось де на допомогу приходить
команда **UNION**! Вона дозволяє з\'єднувати дані з різних таблиць і
створювати нову таблицю, яка містить усі рядки з усіх вихідних таблиць.

Оператор **UNION** поєднує набори результатів двох або більше
операторів SELECT в один набір результатів. Наступний оператор ілюструє,
як використовувати оператор **UNION** для з\'єднання наборів результатів
двох запитів:

```sql
SELECT column1

```
, column2

FROM table1

UNION *\[ALL\]*

```sql
SELECT column3

```
, column4

FROM table2;

Щоб використовувати оператор **UNION**, потрібно прописати окремі
оператори SELECT та об'єднати їх за допомогою ключового слова **UNION**.

```sql
<div style="text-align: center; font-size: 24px;">Важливо </div>
```

Стовпці, які повертаються операторами SELECT, повинні мати **однаковий
(або конвертований) тип даних, розмірність і знаходитися в однаковому
порядку**.

Система бази даних обробляє запит, спочатку виконуючи два
оператори SELECT. Потім запит поєднує два окремі набори результатів в
один й усуває повторювані рядки. Щоб усунути повторювані рядки, система
бази даних сортує об'єднаний набір результатів за кожним стовпцем і
сканує його для пошуку відповідних рядків, які знаходяться поруч.

На практиці ми часто використовуємо оператор **UNION** для об\'єднання
даних з різних таблиць. Розглянемо це на прикладі.

<div align="center">
  <img src="../../assets/images/lesson_3_stvorennia_tablets_struktur/media/image5.png" width="600" />
</div>

У наведеному нижче прикладі використовується оператор **UNION** для
об'єднання імені та прізвища співробітників та їхніх родичів (дружина,
діти, батьки). Якщо в даних виникає ситуація, коли хтось з родичів також
є працівником компанії, то таке ім\'я та прізвище зустрінеться лише один
раз у таблиці результатів, тобто отримаємо лише унікальні записи. (Якщо
ми все ж хочемо зберегти всі записи, враховуючи дублікати, читай далі
про **UNION ALL**.) 

```sql
SELECT first_name

```
<div align="center">
  <img src="../../assets/images/lesson_3_stvorennia_tablets_struktur/media/image6.png" width="600" />
</div>

FROM \"HR\".employees

UNION

```sql
SELECT first_name

```
, last_name

FROM \"HR\".dependents

ORDER BY last_name;

```sql
<div style="text-align: center; font-size: 24px;">Команда UNION ALL</div>
```

📎 *Щоб зберегти повторювані рядки в наборі результатів, використовуй
оператор **UNION ALL**.*

Команда **UNION ALL** працює аналогічно, але з невеликою
відмінністю. **UNION ALL** просто об\'єднує всі рядки з різних таблиць
без перевірки на дублікати. Це означає, що коли в тебе є однакові рядки
в різних таблицях, **UNION ALL** збереже їх усі, не видаляючи жодного.
Це схоже на збір усіх книжок, де жодна сторінка не буде пропущена або
викинута.

Припустимо, що ми маємо два набори результатів: **A (1,2)** і **B
(2,3)**. Наступне зображення ілюструє застосування **UNION**:

<div align="center">
  <img src="../../assets/images/lesson_3_stvorennia_tablets_struktur/media/image7.png" width="600" />
</div>

А наступне зображення ілюструє **UNION ALL**:

<div align="center">
  <img src="../../assets/images/lesson_3_stvorennia_tablets_struktur/media/image8.png" width="600" />
</div>

Ти можеш для попереднього прикладу використати оператор **UNION
ALL** для об\'єднання імені та прізвища співробітників та їх родичів
(дружина, діти, батьки), але зі збереженням дублікатів. Тобто, якщо одна
людина є працівником та водночас родичем іншого працівника --- то таке
ім\'я та прізвище зустрінеться двічі у результаті.

```sql
SELECT first_name

```
> , last_name

FROM \"HR\".employees

> UNION ALL

```sql
SELECT first_name

```
> , last_name

FROM \"HR\".dependents

Основні моменти, які варто підсумувати:

-   Команди **UNION** і **UNION ALL** дозволяють об\'єднувати дані з
    кількох таблиць в одну, створюючи більш повні та комплексні набори
    даних для аналізу.

-   Команда **UNION** об\'єднує дані з різних таблиць, видаляючи
    дублікати рядків. Це корисно, коли потрібно отримати унікальні
    значення з кількох таблиць.

-   Команда **UNION ALL** також об\'єднує дані з різних таблиць, але не
    видаляє дублікати рядків. Це корисно, коли потрібно зберегти всі
    рядки вихідних таблиць, навіть якщо вони повторюються.

-   Під час використання команд **UNION** і **UNION ALL** важливо,
    щоб кількість та типи стовпців в об\'єднуваних таблицях
    були сумісними. В іншому випадку може виникнути помилка.

-   Команди **UNION** і **UNION ALL** є потужними інструментами для
    створення складних запитів, які об\'єднують дані й дозволяють
    отримувати більш повну інформацію з кількох джерел.

-   Розуміння різниці між **UNION** і **UNION ALL** допоможе вибрати
    відповідний варіант, залежно від конкретних потреб і вимог до даних.

-   Під час використання команд **UNION** і **UNION** **ALL** слід
    звернути увагу на продуктивність, особливо під час роботи з великими
    обсягами даних. Іноді можна використовувати додаткові оптимізації
    для покращення швидкості виконання запитів.

Отже, команди **UNION** і **UNION** **ALL** надають потужні можливості
для об\'єднання даних в SQL. Вивчення їх функціональності і правильне
застосування допоможуть тобі ефективно розв\'язувати різноманітні задачі
з аналізу та маніпуляції даними в базах даних.
